import random
# Напишите игру с копьютером 'Камень, ножницы, бумага'
# В начале игры надо напечатать правила.
# игрок должен ввести своё имя/ник, который будет отображаться в результатах
# Пользователь вводит один из символов (к, н, б)
# компьютер высчитывает свой вариант
# компьютер не должен знать о варианте пользователя
# В терминал должна выводиться фраза формата:
    # Камень // Бумага - победил компьютер. Счёт 0-1
    # Камень // Ножницы - победил ProPHet. Счёт 1-1
    # Камень // Камень - ничья. Счёт 1-1
# пользователь может ввести букву В, что будет означать выход из игры
# В этом случае будут подсчитаны результаты всех раундов и определён победитель
    # ProPHet победил со счётом 15-10
правила = """Игра "Камень, ножницы, бумага!"
Когда игра начнётся, введите один из вариантов: К, Б, или Н. Не важно, маленькими или большими буквами.
Компьютер в это время тоже сделает свой ход и напишет результат. Будет считаться накопительный счёт.
Введите С для сброса счёта.
Введите В, когда захотите закончить игру."""
print(правила)
ник=input("введите свой ник:")
class Игрок:
    def __init__(self,имя) -> None:
        self.ник=имя
        self.ход=""
        self.счёт=0
        self.название_хода=""
    def записать_ход(self, команда):
        ходы={
            "к":"камень",
            "н":"ножницы",
            "б":"бумага"
        }
        self.название_хода=ходы.get(команда)
        self.ход=команда
user=Игрок(ник)
комп=Игрок("-ты бездушная машина,ты не можешь сочинить симфонию,написать шедевр.-а ты можешь?")
ДОПУСТИМЫЕ_КОМАНДЫ=("к","н","б","с","в")

def определить_победителя(user, комп):
    if комп.ход == user.ход:
        print(f"{user.название_хода}//{комп.счёт} - ничья. Счёт {user.счёт}-{комп.счёт}")
        return None
    if((user.ход=="к" and комп.ход=="н") or (user.ход=="н" and комп.ход=="б") or (user.ход=="б" and комп.ход=="к")):
        return user
    return комп

while True:
    команда=input("введите команду:").lower()
    if команда not in ДОПУСТИМЫЕ_КОМАНДЫ:
        print("КОМАНДА НЕ РАСПОЗНАНА!!!!")
        continue
    print("КОМАНДА РАСПОЗНАНА")
    if команда=="в":
        break
    if команда=="с":
        user.счёт=0
        комп.счёт=0
        print("СЧЁТ СБРОШЕН!!!!")
        continue
    user.записать_ход(команда)
    комп.записать_ход(random.choice(["к","н","б"]))
    победитель=определить_победителя(user,комп)
    if победитель !=None:
        победитель.счёт +=1
        print(F"{user.название_хода}//{комп.название_хода}- ПОБЕДИЛ-{ник}.СЧЁТ-{user.счёт}-{комп.счёт}")
def определить_итогового_победителя(user,комп):
    if user.счёт==комп.счёт:
        print(F"ничья со счётом {user.счёт}-{комп.счёт}")
        return None,None
    if user.счёт > комп.счёт:
        return user,комп
    return комп,user
победитель,проигравший=определить_итогового_победителя(user,комп)
if победитель !=None:
    print(F"В итоге победил {победитель.ник} со счётом {user.счёт}-{комп.счёт} ")